In [2]:
import pandas as pd
import numpy as np

In [4]:
# Read the customer data
df_customers = pd.read_csv('data/twm_customer.csv', sep=';')
df_customers.head()

,cust_id,income,age,years_with_bank,nbr_children,gender,marital_status,name_prefix,first_name,last_name,street_nbr,street_name,postal_code,city_name,state_code
0,1362691,26150,46,5,1,M,2,,Donald ...,Marek ...,8298,Second ...,89194,Las Vegas,NV
1,1362487,6605,71,1,0,M,2,,ChingDyi ...,Moussavi ...,10603,Daffodil ...,90159,Los Angeles,CA
2,1363160,18548,38,8,0,F,1,,Rosa ...,Johnston ...,8817,Figueroa ...,90024,Los Angeles,CA
3,1362752,47668,54,3,0,F,1,,Lisa ...,Martin ...,676,Humble ...,90172,Los Angeles,CA
4,1362548,44554,59,9,2,F,4,,Barbara ...,O'Malley ...,6578,C ...,10138,New York City,NY

In [21]:
len(credit_tran['cust_id'].unique())

452

In [10]:
# Read the transactions data
checking_tran = pd.read_csv('data/checking_tran_clean.csv')
checking_tran.head()

   cust_id  tran_amt
0  1363481     -0.15
1  1362784   -200.00
2  1363088      0.00
3  1363306    -40.32
4  1363251    -87.88

In [9]:

credit_tran = pd.read_csv('data/credit_tran_clean.csv')
credit_tran.head()

   cust_id  tran_amt
0  1363088   -121.49
1  1363306   -220.64
2  1362959      0.00
3  1363429   -195.27
4  1363393    -37.32

In [15]:
savings_tran = pd.read_csv('data/result_savings_tran_clean.csv')
savings_tran.head()

   cust_id  tran_amt
0  1363481    136.03
1  1362746      2.83
2  1363251     13.56
3  1362542      0.76
4  1363387    148.69

In [17]:
trans = pd.read_csv('data/result_tran_clean.csv')
trans.head()

   transaction_count  avg_tran_amt
0                 96    -16.894167
1                 26     18.550769
2                 99    -25.435758
3                 33     58.474545
4                 99     -1.659495